KLFAMO/phase_detector_Artiq/stm32cube/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PHDET_MOSI_Pin GPIO_PIN_1
#define PHDET_MOSI_GPIO_Port GPIOC
#define PHDET_MISO_Pin GPIO_PIN_2
#define PHDET_MISO_GPIO_Port GPIOC
#define XREF_Pin GPIO_PIN_0
#define XREF_GPIO_Port GPIOA
#define XVCO_Pin GPIO_PIN_4
#define XVCO_GPIO_Port GPIOA
#define DIV2_S1_Pin GPIO_PIN_8
#define DIV2_S1_GPIO_Port GPIOE
#define DIV2_S2_Pin GPIO_PIN_9
#define DIV2_S2_GPIO_Port GPIOE
#define DIV2_S0_Pin GPIO_PIN_10
#define DIV2_S0_GPIO_Port GPIOE
#define DIV1_S2_Pin GPIO_PIN_11
#define DIV1_S2_GPIO_Port GPIOE
#define DIV1_S1_Pin GPIO_PIN_12
#define DIV1_S1_GPIO_Port GPIOE
#define DIV1_S0_Pin GPIO_PIN_13
#define DIV1_S0_GPIO_Port GPIOE
#define PHDET_CEN_Pin GPIO_PIN_14
#define PHDET_CEN_GPIO_Port GPIOE
#define PHDET_NSS_Pin GPIO_PIN_12
#define PHDET_NSS_GPIO_Port GPIOB
#define PHDET_SCK_Pin GPIO_PIN_13
#define PHDET_SCK_GPIO_Port GPIOB
#define STLINK_RX_Pin GPIO_PIN_8
#define STLINK_RX_GPIO_Port GPIOD
#define STLINK_TX_Pin GPIO_PIN_9
#define STLINK_TX_GPIO_Port GPIOD
#define TXD2_Pin GPIO_PIN_6
#define TXD2_GPIO_Port GPIOC
#define RXD2_Pin GPIO_PIN_7
#define RXD2_GPIO_Port GPIOC
#define TXD1_Pin GPIO_PIN_9
#define TXD1_GPIO_Port GPIOA
#define RXD1_Pin GPIO_PIN_10
#define RXD1_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
